---
kind: property
id: P:Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.HasExtrusionDirection
source: html/7b1c95e7-5d86-5151-9969-0beaf98b7d89.htm
---
# Autodesk.Revit.DB.IFC.IFCExtrusionCreationData.HasExtrusionDirection Property

Identifies if the data contains a extrusion direction.

## Syntax (C#)
```csharp
public bool HasExtrusionDirection { get; }
```